src/cf/Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Comment>Файлы в папках</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор - пользователь, добавивший файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Comment>Владелец файла</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаема</Name>
					<Comment>Дата заема на редактирование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата добавления файла в базу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зашифрован</Name>
					<Comment>Файл зашифрован</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Comment>Индекс иконки, соответствующей расширению файла, для показа в списке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУдалятьСтарыеВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Comment>Файл подписан ЭП</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Comment>Полное наименование (длиной до 256 символов)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактирует</Name>
					<Comment>Пользователь, занявший файл для редактирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтратегияРаспознавания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтратегииРаспознаванияТекста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсия</Name>
					<Comment>Активная версия</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияАвтор</Name>
					<Comment>Автор - пользователь, создавший версию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияДатаМодификацииФайла</Name>
					<Comment>Дата модификации файла - в локальном времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияДатаСоздания</Name>
					<Comment>Дата создания версии</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияКод</Name>
					<Comment>Текущая версия код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияНомерВерсии</Name>
					<Comment>Номер версии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияПутьКФайлу</Name>
					<Comment>Дополнительный путь к файлу на диске (в случае если тип хранения файла - на диске)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияРазмер</Name>
					<Comment>Размер файла версии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияРасширение</Name>
					<Comment>Расширение файла версии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияТом</Name>
					<Comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТекстХранилище</Name>
					<Comment>Текст, извлеченный из файла - для полнотекстового поиска   в 3.0.10 переименовано</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВерсии</Name>
					<Comment>Хранить версии - если Ложь, у файла всегда одна версия - активная</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОснованиеДляСоздания</Name>
					<Comment>Шаблон файла, на основании которого был создан данный файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯзыкРаспознавания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СубъектыПерсональныхДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonForms/ЦППК_ФормаПодписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Файлы = Неопределено;
	Параметры.Свойство("Файлы", Файлы);
	
	ТекущийДокумент = Параметры.ТекущийДокумент;
	
	Если Файлы <> Неопределено Тогда
		
		Для Каждого ЭлементТаблицы Из Файлы Цикл
			НоваяСтрока 					= ТаблицаСФайлами.Добавить();
			НоваяСтрока.Ссылка				= ЭлементТаблицы.Файл;
			НоваяСтрока.Наименование	    = ЭлементТаблицы.Файл.Наименование;
			НоваяСтрока.ДатаСоздания		= ЭлементТаблицы.Файл.ДатаСоздания;
			НоваяСтрока.ПодписанЭП			= ЭлементТаблицы.Файл.ПодписанЭП;  
			НоваяСтрока.Описание			= ЭлементТаблицы.Файл.Описание;
			НоваяСтрока.ИндексКартинки		= ЭлементТаблицы.Файл.ИндексКартинки;
			НоваяСтрока.Автор				= ЭлементТаблицы.Файл.Автор;
		КонецЦикла;                                                  
		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Файл" Тогда
		Если Параметр.Свойство("Файл") Тогда
			ДобавитьФайлНаФорму(Параметр.Файл);
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "ИмпортФайловЗавершен" Тогда
		ДобавитьФайлНаФорму(Источник.МассивСсылокФайлов);
	КонецЕсли;
	
	Если ИмяСобытия = "ПрисоединенныйФайлПодписан" И Параметр = ТекущийДокумент Тогда
		Закрыть(Новый Структура("ФайлыПодписаны", Истина));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодписатьФайлы(Команда) //Подписать только выделенные строки

	НачатьПодписьФайлов(Ложь);
	//ЗарегистрироватьДокумент();
	//МассивДляПодписи = Новый Массив;
	//
	//Для Каждого СтрокаТЧ Из ТаблицаСФайлами Цикл
	//	Если Не СтрокаТЧ.ПодписанЭП И СтрокаТЧ.НаПодпись Тогда
	//		МассивДляПодписи.Добавить(СтрокаТЧ.Ссылка);
	//	КонецЕсли;
	//КонецЦикла; 
	//
	//Если МассивДляПодписи.Количество() > 0 Тогда
	//	ПодписатьФайл(МассивДляПодписи); 
	//	Оповестить("ПодписаноЧерезФормуПодписи_ВыполнитьЗадачу",,ЭтотОбъект);
	//Иначе
	//	ТекстСообщения = НСтр("ru = 'Файлов для подписи не обнаружено(возможно уже все файлы подписаны ранее)'");
	//	Оповестить("ВыполнитьДействиеЗадачиНаКлиентеВФорме_НеВыполненаВФормеПодписи",ТекстСообщения,ЭтотОбъект);	
	//КонецЕсли;
	
	//ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьВсеФайлы(Команда)
	
	НачатьПодписьФайлов(Истина);
	//
	//ЗарегистрироватьДокумент();
	//МассивДляПодписи = Новый Массив;
	//
	//Для Каждого СтрокаТЧ Из ТаблицаСФайлами Цикл
	//	Если Не СтрокаТЧ.ПодписанЭП Тогда
	//		МассивДляПодписи.Добавить(СтрокаТЧ.Ссылка);
	//	КонецЕсли;
	//КонецЦикла; 
	//
	//Если МассивДляПодписи.Количество() > 0 Тогда
	//	ПодписатьФайл(МассивДляПодписи); 
	//	Оповестить("ПодписаноЧерезФормуПодписи_ВыполнитьЗадачу",,ЭтотОбъект);
	//Иначе
	//	ТекстСообщения = НСтр("ru = 'Файлов для подписи не обнаружено(возможно уже все файлы подписаны ранее)'");
	//	Оповестить("ВыполнитьДействиеЗадачиНаКлиентеВФорме_НеВыполненаВФормеПодписи",ТекстСообщения,ЭтотОбъект);	
	//КонецЕсли;
	//
	//ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	ПараметрыДобавления = Новый Структура;
	ФайлыПередНачаломДобавленияКлиент(Элементы.ТаблицаСФайлами, Истина, Ложь, Неопределено, Неопределено, ПараметрыДобавления);

КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьДокумент1(Команда)
	ЗарегистрироватьДокумент();
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

#Область Подписи

&НаКлиенте
Процедура ПодписатьФайл(МассивФайлов)
	
	ЗарегистрироватьДокумент();
	
	Если НЕ ИнформацияОРегистрации Тогда
		Возврат;
	КонецЕсли;

	ДанныеФайла = РаботаСФайламиВызовСервера.ДанныеФайла(МассивФайлов[0]);
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("ВладелецФайла", ДанныеФайла.Владелец);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодписатьФайлЗавершение", ЭтотОбъект, ПараметрыВыполнения);
	
	РаботаСФайламиСлужебныйКлиент.ПодписатьФайл(МассивФайлов, УникальныйИдентификатор, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьФайлЗавершение(Результат, ПараметрыВыполнения) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	Оповестить("ПрисоединенныйФайлПодписан", ПараметрыВыполнения.ВладелецФайла);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьДокумент()
	
	ОписаниеОшибки = НСтр("ru = 'Документ не удалось зарегистрировать.'");
	Попытка
		
		Если ТекущийДокумент = ПустойДокумент() Тогда
			ВызватьИсключение(НСтр("ru = 'Не удалось получить сведения для регистрации документа. Документ не зарегистрирован! (в подписи не будет указан рег. номер)'"));
		КонецЕсли;
		
		Если Не Делопроизводство.ЗарегистрироватьПредмет(
			ТекущийДокумент, ОписаниеОшибки) Тогда
			
			ВызватьИсключение ОписаниеОшибки;
		КонецЕсли;
		ИнформацияОРегистрации = Истина;
	Исключение
		ИнформацияОРегистрации = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось зарегистрировать документ'"));
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПустойДокумент()
	Возврат Справочники.ДокументыПредприятия.ПустаяСсылка();
КонецФункции

#КонецОбласти

#Область ДобавлениеФайла

&НаКлиенте
Процедура ФайлыПередНачаломДобавленияКлиент(Элемент, Отказ, Копирование, Родитель, Группа, ПараметрыДобавления)
	
	ДобавлениеОригинала = ПараметрыДобавления.Свойство("ДобавлениеОригинала", ДобавлениеОригинала);

	ВладелецФайла = ТекущийДокумент;
	
	РольФайла = Неопределено;
	
	СтруктураТекущегоДокумента = СтруктураТекущегоДокумента(ТекущийДокумент);
	
	ТекущиеДанные = Элементы.ТаблицаСФайлами.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.РольФайла) Тогда
		РольФайла = ТекущиеДанные.РольФайла;
	ИначеЕсли ТаблицаСФайлами.Количество() <> 0 Тогда	
		СтрФайлы = ТаблицаСФайлами[0];
		Если ЗначениеЗаполнено(СтрФайлы.РольФайла) Тогда
			РольФайла = СтрФайлы.РольФайла;
		КонецЕсли;		
	КонецЕсли;	
	
	МожноДобавитьТолькоОдинФайл = Ложь;
	
	Если Не Копирование Тогда
		Попытка
			
			РежимСоздания = ?(ДобавлениеОригинала, 2, 1);
			ДополнительныеПараметры = Новый Структура("МожноДобавитьТолькоОдинФайл", МожноДобавитьТолькоОдинФайл);
			
			РаботаСФайламиКлиент.ДобавитьФайл(Неопределено, ВладелецФайла, 
				ЭтаФорма, РежимСоздания, Истина, ДобавлениеОригинала,,,,,
				СтруктураТекущегоДокумента.Шаблон, РольФайла, , ДополнительныеПараметры);
				
		Исключение
			ПоказатьПредупреждение(, ФайловыеФункцииСлужебныйКлиентСервер.ОшибкаСозданияНовогоФайла(
				ИнформацияОбОшибке()));
		КонецПопытки;
	Иначе
		ТекущиеДанные = Элементы.ТаблицаСФайлами.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда 
			Возврат;
		КонецЕсли;	
		ФайлОснование = ТекущиеДанные.Ссылка;
		
		СкопироватьФайл(ВладелецФайла, ФайлОснование);
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура СкопироватьФайл(ВладелецФайла, ФайлОснование)
	
	Если Не ЗначениеЗаполнено(ВладелецФайла) Тогда
		Шаблон = НСтр("ru = 'Не задано значение параметра %1 в %2.'");
		ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, "ВладелецФайла",
			"РаботаСФайламиКлиент.СкопироватьФайл");
	КонецЕсли;
	
	Параметры = Новый Структура("ФайлОснование, ВладелецФайла, БылаОткрытаФормаПодписи", ФайлОснование, ВладелецФайла, Истина);
	Форма = ОткрытьФорму("Справочник.Файлы.ФормаОбъекта", Параметры);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураТекущегоДокумента(Знач ТекДокумент)
	
	СтруктураДокумента = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыПредприятия.Шаблон КАК Шаблон
		|ИЗ
		|	Справочник.ДокументыПредприятия КАК ДокументыПредприятия
		|ГДЕ
		|	ДокументыПредприятия.Ссылка = &ТекДокумент";
	
	Запрос.УстановитьПараметр("ТекДокумент", ТекДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
    	СтруктураДокумента.Вставить("Шаблон", Выборка.Шаблон);
	КонецЦикла;

    Возврат СтруктураДокумента;
	
КонецФункции

&НаСервере
Процедура ДобавитьФайлНаФорму(Знач НовыеФайлы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.Ссылка КАК Ссылка,
		|	Файлы.Наименование КАК Наименование,
		|	Файлы.ДатаСоздания КАК ДатаСоздания,
		|	Файлы.Описание КАК Описание,
		|	Файлы.ИндексКартинки КАК ИндексКартинки,
		|	Файлы.Автор КАК Автор,
		|	Файлы.ПодписанЭП КАК ПодписанЭП
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.Ссылка В (&НовыеФайлы)";
		
		Запрос.УстановитьПараметр("НовыеФайлы", НовыеФайлы);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = ТаблицаСФайлами.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка); 
		КонецЦикла;                                        
		

КонецПроцедуры

&НаКлиенте
Асинх Процедура НачатьПодписьФайлов(ВсеФайлы = Ложь)

	ЗарегистрироватьДокумент();
	МассивДляПодписи = Новый Массив;
	
	Для Каждого СтрокаТЧ Из ТаблицаСФайлами Цикл
		Если Не СтрокаТЧ.ПодписанЭП И (СтрокаТЧ.НаПодпись ИЛИ ВсеФайлы) Тогда
			МассивДляПодписи.Добавить(СтрокаТЧ.Ссылка);
		КонецЕсли;
	КонецЦикла; 
	
	Если МассивДляПодписи.Количество() > 0 Тогда
		ПодписатьФайл(МассивДляПодписи); 
		//Оповестить("ПодписаноЧерезФормуПодписи_ВыполнитьЗадачу",,ЭтотОбъект);
	ИначеЕсли ТаблицаСФайлами.Количество() > 0 Тогда
		Результат = Ждать ВопросАсинх("Файлы уже подписаны. Завершить задачу?", РежимДиалогаВопрос.ДаНет);
		Если Результат = КодВозвратаДиалога.Да Тогда
			Закрыть(Новый Структура("ФайлыПодписаны", Истина));
		КонецЕсли;
	Иначе
		ТекстСообщения = НСтр("ru = 'Не удалось завершить задачу. Нет файлов к подписанию или подписанных'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#КонецОбласти
